
#include <stdio.h>
#include <errno.h>
#include <malloc.h>
#include <stdlib.h>
#include <stdarg.h>
#include <stdint.h>
#include <stddef.h>
#include <unistd.h>

#include <hw/dos/dos.h>
#include <hw/dos/doswin.h>
#include <hw/cpu/cpu.h>
#include <hw/vga/vga.h>
#include <hw/8042/8042.h>
#include <hw/8254/8254.h>
#include <hw/8259/8259.h>

#include "gif_lib.h"

FILE *debug_log = NULL;

void release_timer(void);

void DEBUG(const char *fmt,...) {
    va_list va;

    if (debug_log == NULL) return;

    va_start(va,fmt);
    vfprintf(debug_log,fmt,va);
    va_end(va);
    fprintf(debug_log,"\n");
}

void FAIL(const char *msg) {
    DEBUG("FAIL: %s",msg);
    release_timer();
    int10_setmode(0x3); /* text mode */
    puts(msg);
    exit(1);
}

/* font FNT blob */
typedef struct FNTBlob {
    unsigned char*          raw;
    size_t                  raw_length;
    size_t                  block_ofs[5+1-1]; /* start from 1, up to 5 inclusive */
    GifFileType*            gif;
    SavedImage*             img;
    unsigned char           ascii_lookup[127-32]; /* quick lookup for common ASCII chars 0xFF = no such entry */
} FNTBlob;

unsigned char *FNTBlob_get_block(FNTBlob *b,unsigned int block,size_t *sz) {
    unsigned char *p;
    size_t o;

    if (b == NULL || block < 1 || block > 5 || sz == NULL)
        return NULL;
    if (b->raw == NULL)
        return NULL;

    o = b->block_ofs[block-1];
    if (o == 0)
        return NULL;

    p = b->raw + o;
    *sz = (size_t) *((uint32_t*)(p-4));
    return p;
}

#pragma pack(push,1)
typedef struct FNTBlob_info {
    int16_t             fontSize;           // +0x00
    uint8_t             bitField;           // +0x02
    uint8_t             charSet;            // +0x03
    uint16_t            stretchH;           // +0x04
    uint8_t             aa;                 // +0x06
    uint8_t             paddingUp;          // +0x07
    uint8_t             paddingRight;       // +0x08
    uint8_t             paddingDown;        // +0x09
    uint8_t             paddingLeft;        // +0x0A
    uint8_t             spacingHoriz;       // +0x0B
    uint8_t             spacingVert;        // +0x0C
    uint8_t             outline;            // +0x0D
    // don't care beyond this point
} FNTBlob_info;

typedef struct FNTBlob_common {
    uint16_t            lineHeight;         // +0x00
    uint16_t            base;               // +0x02
    uint16_t            scaleW;             // +0x04
    uint16_t            scaleH;             // +0x06
    uint16_t            pages;              // +0x08
    uint8_t             bitField;           // +0x0A
    uint8_t             alphaChnl;          // +0x0B
    uint8_t             redChnl;            // +0x0C
    uint8_t             greenChnl;          // +0x0D
    uint8_t             blueChnl;           // +0x0E
} FNTBlob_common;

typedef struct FNTBlob_chars {
    uint32_t            id;                 // +0x00
    uint16_t            x;                  // +0x04
    uint16_t            y;                  // +0x06
    uint16_t            w;                  // +0x08
    uint16_t            h;                  // +0x0A
    int16_t             xoffset;            // +0x0C
    int16_t             yoffset;            // +0x0E
    int16_t             xadvance;           // +0x10
    uint8_t             page;               // +0x12
    uint8_t             chnl;               // +0x13
} FNTBlob_chars;                            // =0x14
#pragma pack(pop)

FNTBlob_info *FNTBlob_get_info(FNTBlob *b) {
    size_t sz;
    unsigned char *p = FNTBlob_get_block(b,/*info*/1,&sz);
    if (p == NULL || sz < sizeof(FNTBlob_info)) return NULL;

    return (FNTBlob_info*)p;
}

FNTBlob_common *FNTBlob_get_common(FNTBlob *b) {
    size_t sz;
    unsigned char *p = FNTBlob_get_block(b,/*common*/2,&sz);
    if (p == NULL || sz < sizeof(FNTBlob_common)) return NULL;

    return (FNTBlob_common*)p;
}

FNTBlob_chars *FNTBlob_get_chars(FNTBlob *b,FNTBlob_chars **fence) {
    size_t sz;
    unsigned char *p = FNTBlob_get_block(b,/*chars*/4,&sz);
    if (p == NULL || sz < sizeof(FNTBlob_chars)) return NULL;
    *fence = (FNTBlob_chars*)(p+sz);
    return (FNTBlob_chars*)p;
}

FNTBlob_chars *FNTBlob_find_char(FNTBlob *b,uint32_t id) {
    FNTBlob_chars *cf;
    FNTBlob_chars *c = FNTBlob_get_chars(b,&cf);
    if (c == NULL) return NULL;
