
#include <assert.h>
#include <stdlib.h>
#include <stdint.h>
#include <string.h>
#include <unistd.h>
#include <stddef.h>
#include <errno.h>
#include <stdio.h>
#include <fcntl.h>
#include <ctype.h>

#include <hw/dos/exehdr.h>
#include <hw/dos/exenehdr.h>
#include <hw/dos/exenepar.h>

#ifndef O_BINARY
#define O_BINARY (0)
#endif

#define EXE_PE_SIGNATURE                                                        (0x4550U)

/* Characteristics flags */
#define EXE_PE_HEADER_IMAGE_FILE_RELOCS_STRIPPED                                0x0001
#define EXE_PE_HEADER_IMAGE_FILE_EXECUTABLE_IMAGE                               0x0002
#define EXE_PE_HEADER_IMAGE_FILE_LINE_NUMS_STRIPPED                             0x0004
#define EXE_PE_HEADER_IMAGE_FILE_LOCAL_SYMS_STRIPPED                            0x0008
#define EXE_PE_HEADER_IMAGE_FILE_AGGRESSIVE_WS_TRIM                             0x0010
#define EXE_PE_HEADER_IMAGE_FILE_LARGE_ADDRESS_AWARE                            0x0020
#define EXE_PE_HEADER_IMAGE_FILE_16BIT_MACHINE                                  0x0040
#define EXE_PE_HEADER_IMAGE_FILE_BYTES_REVERSED_LO                              0x0080
#define EXE_PE_HEADER_IMAGE_FILE_32BIT_MACHINE                                  0x0100
#define EXE_PE_HEADER_IMAGE_FILE_DEBUG_STRIPPED                                 0x0200
#define EXE_PE_HEADER_IMAGE_FILE_REMOVABLE_RUN_FROM_SWAP                        0x0400
#define EXE_PE_HEADER_IMAGE_FILE_NET_RUN_FROM_SWAP                              0x0800
#define EXE_PE_HEADER_IMAGE_FILE_SYSTEM                                         0x1000
#define EXE_PE_HEADER_IMAGE_FILE_DLL                                            0x2000
#define EXE_PE_HEADER_IMAGE_FILE_UP_SYSTEM_ONLY                                 0x4000
#define EXE_PE_HEADER_IMAGE_FILE_BYTES_REVERSED_HI                              0x8000

#pragma pack(push,1)
struct exe_pe_coff_file_header {
        uint16_t                                Machine;                        /* +0x00 target machine */
        uint16_t                                NumberOfSections;               /* +0x02 number of PE sections */
        uint32_t                                TimeDateStamp;                  /* +0x04 Time/Date timestamp */
        uint32_t                                PointerToSymbolTable;           /* +0x08 File offset of COFF symbol table or 0 */
        uint32_t                                NumberOfSymbols;                /* +0x0C Number of entries in symbol table */
        uint16_t                                SizeOfOptionalHeader;           /* +0x10 Size of the optional header */
        uint16_t                                Characteristics;                /* +0x12 Flags indicating attributes of the file */
};                                                                              /* =0x14 */
#pragma pack(pop)

#pragma pack(push,1)
/* This is the initial header. It does not define anything more because fields past this struct do vary */
struct exe_pe_header {
        uint32_t                                signature;                      /* +0x00 PE\0\0 */
        struct exe_pe_coff_file_header          fileheader;                     /* +0x04 COFF File Header (0x14 bytes) */
};                                                                              /* =0x18 */
/* optional header follows including section table */
#pragma pack(pop)

struct exe_pe_optional_header_raw {
        unsigned char*                          data;
        size_t                                  size;
        size_t                                  alloc_size;
};

const char *exe_pe_fileheader_machine_to_str(const uint16_t Machine) {
        switch (Machine) {
                case 0x0000:    return "UNKNOWN";
                case 0x014C:    return "I386";
                case 0x0162:    return "R3000";
                case 0x0166:    return "R4000";
                case 0x0168:    return "R10000";
                case 0x0169:    return "WCEMIPSV2";
                case 0x0184:    return "ALPHA";
                case 0x01A2:    return "SH3";
                case 0x01A3:    return "SH3DSP";
                case 0x01A6:    return "SH4";
                case 0x01A8:    return "SH5";
                case 0x01C0:    return "ARM";
                case 0x01C2:    return "THUMB";
                case 0x01D3:    return "AM33";
                case 0x01F0:    return "POWERPC";
                case 0x01F1:    return "POWERPCFP";
                case 0x0200:    return "IA64";
                case 0x0266:    return "MIPS16";
                case 0x0268:    return "M68K";
                case 0x0284:    return "ALPHA64";
                case 0x0366:    return "MIPSFPU";
                case 0x0466:    return "MIPSFPU16";
                case 0x0EBC:    return "EBC";
                case 0x8664:    return "AMD64";
                case 0x9041:    return "M32R";
                default:        break;
        }

        return "?";
}

#define EXE_PE_OPTHDR_MAGIC_ROM                         (0x0107)
#define EXE_PE_OPTHDR_MAGIC_PE				(0x010B)
#define EXE_PE_OPTHDR_MAGIC_PEPLUS			(0x020B)

#pragma pack(push,1)
struct exe_pe_opthdr_pe_standard { // EXE_PE_OPTHDR_MAGIC_PE
        uint16_t                                        Magic;                          /* +0x00 */
        uint8_t                                         MajorLinkerVersion;             /* +0x02 */
        uint8_t                                         MinorLinkerVersion;             /* +0x03 */
        uint32_t                                        SizeOfCode;                     /* +0x04 size of code [text], sum total */
        uint32_t                                        SizeOfInitializedData;          /* +0x08 size of initialized data, sum total */
        uint32_t                                        SizeOfUninitializedData;        /* +0x0C size of uninitialized data [bss], sum total */
        uint32_t                                        AddressOfEntryPoint;            /* +0x10 RVA of entry point, 0 if none (DLL) */
        uint32_t                                        BaseOfCode;                     /* +0x14 RVA of the base of code section */
        uint32_t                                        BaseOfData;                     /* +0x18 RVA of the base of data section */
};                                                                                      /* =0x1C */

struct exe_pe_opthdr_pe_windows {
        uint32_t                                        ImageBase;                      /* +0x00 (+0x1C) preferred loading address */
        uint32_t                                        SectionAlignment;               /* +0x04 (+0x20) */
        uint32_t                                        FileAlignment;                  /* +0x08 (+0x24) */
        uint16_t                                        MajorOperatingSystemVersion;    /* +0x0C (+0x28) */
        uint16_t                                        MinorOperatingSystemVersion;    /* +0x0E (+0x2A) */
        uint16_t                                        MajorImageVersion;              /* +0x10 (+0x2C) */
        uint16_t                                        MinorImageVersion;              /* +0x12 (+0x2E) */
        uint16_t                                        MajorSubsystemVersion;          /* +0x14 (+0x30) */
        uint16_t                                        MinorSubsystemVersion;          /* +0x16 (+0x32) */
        uint32_t                                        Win32VersionValue;              /* +0x18 (+0x34) Reserved, zero */
        uint32_t                                        SizeOfImage;                    /* +0x1C (+0x38) */
        uint32_t                                        SizeOfHeaders;                  /* +0x20 (+0x3C) */
        uint32_t                                        CheckSum;                       /* +0x24 (+0x40) */
        uint16_t                                        Subsystem;                      /* +0x28 (+0x44) */
        uint16_t                                        DLLCharacteristics;             /* +0x2A (+0x46) */
        uint32_t                                        SizeOfStackReserve;             /* +0x2C (+0x48) */
        uint32_t                                        SizeOfStackCommit;              /* +0x30 (+0x4C) */
        uint32_t                                        SizeOfHeapReserve;              /* +0x34 (+0x50) */
        uint32_t                                        SizeOfHeapCommit;               /* +0x38 (+0x54) */
        uint32_t                                        LoaderFlags;                    /* +0x3C (+0x58) */
        uint32_t                                        NumberOfRvaAndSizes;            /* +0x40 (+0x5C) */
};                                                                                      /* =0x44 (+0x60) */

struct exe_pe_opthdr_data_directory_entry {
	uint32_t					RVA;				/* +0x00 */
	uint32_t					Size;				/* +0x04 */
};											/* =0x08 */
/* NTS: The "RVA" is a file offset if it's the directory entry index for the certificate table. */

enum exe_pe_opthdr_data_directory_index {
        EXE_PE_DATADIRENT_EXPORT_TABLE=0,
        EXE_PE_DATADIRENT_IMPORT_TABLE=1,
        EXE_PE_DATADIRENT_RESOURCE_TABLE=2,
        EXE_PE_DATADIRENT_EXCEPTION_TABLE=3,
        EXE_PE_DATADIRENT_CERTIFICATE_TABLE=4, // "RVA" is a file offset
        EXE_PE_DATADIRENT_BASE_RELOCATION_TABLE=5,
        EXE_PE_DATADIRENT_DEBUG=6,
        EXE_PE_DATADIRENT_ARCHITECTURE=7,
        EXE_PE_DATADIRENT_GLOBAL_PTR=8, // RVA to store in global ptr register, size must be zero
        EXE_PE_DATADIRENT_TLS_TABLE=9,
        EXE_PE_DATADIRENT_LOAD_CONFIG_TABLE=10,
        EXE_PE_DATADIRENT_BOUND_IMPORT=11,
        EXE_PE_DATADIRENT_IAT=12,
        EXE_PE_DATADIRENT_DELAY_IMPORT_DESCRIPTOR=13,
        EXE_PE_DATADIRENT_COMPLUS_RUNTIME_HEADER=14,
        EXE_PE_DATADIRENT_CLR_RUNTIME_HEADER=14,
        EXE_PE_DATADIRENT_RESERVED15=15,

        EXE_PE_DATADIRENT__MAX
};

const char *exe_pe_opthdr_data_directory_entry_str[EXE_PE_DATADIRENT__MAX] = {
        "Export table",                 // 0
        "Import table",
        "Resource table",
        "Exception table",
        "Certificate table",
        "Base relocation table",        // 5
        "Debug",
        "Architecture",
        "Global ptr",
        "TLS table",
        "Load config table",            // 10
        "Bound import",
        "IAT",
        "Delay import descriptor",
        "COM+/CLR runtime header",
        "Reserved"                      // 15
};

const char *exe_pe_opthdr_data_directory_entry_to_str(unsigned int i) {
        if (i < EXE_PE_DATADIRENT__MAX)
                return exe_pe_opthdr_data_directory_entry_str[i];
        return "?";
}

enum exe_pe_opthdr_subsystem {
        EXE_PE_OPTHDR_SUBSYSTEM_UNKNOWN=0,
        EXE_PE_OPTHDR_SUBSYSTEM_NATIVE=1,
        EXE_PE_OPTHDR_SUBSYSTEM_WINDOWS_GUI=2,
        EXE_PE_OPTHDR_SUBSYSTEM_WINDOWS_CUI=3,
        EXE_PE_OPTHDR_SUBSYSTEM_POSIX_CUI=7,
        EXE_PE_OPTHDR_SUBSYSTEM_WINDOWS_CE_GUI=9,
        EXE_PE_OPTHDR_SUBSYSTEM_EFI_APPLICATION=10,
        EXE_PE_OPTHDR_SUBSYSTEM_EFI_BOOT_SERVICE_DRIVER=11,
        EXE_PE_OPTHDR_SUBSYSTEM_EFI_RUNTIME_DRIVER=12,

        EXE_PE_OPTHDR_SUBSYSTEM__MAX
};

const char *exe_pe_opthdr_subsystem_to_str(const uint16_t s) {
        switch (s) {
                case EXE_PE_OPTHDR_SUBSYSTEM_UNKNOWN:           return "UNKNOWN";
                case EXE_PE_OPTHDR_SUBSYSTEM_NATIVE:            return "NATIVE";
                case EXE_PE_OPTHDR_SUBSYSTEM_WINDOWS_GUI:       return "WINDOWS_GUI";
                case EXE_PE_OPTHDR_SUBSYSTEM_WINDOWS_CUI:       return "WINDOWS_CUI";
                case EXE_PE_OPTHDR_SUBSYSTEM_POSIX_CUI:         return "POSIX_CUI";
                case EXE_PE_OPTHDR_SUBSYSTEM_WINDOWS_CE_GUI:    return "WINDOWS_CE_GUI";
                case EXE_PE_OPTHDR_SUBSYSTEM_EFI_APPLICATION:   return "EFI_APPLICATION";
                case EXE_PE_OPTHDR_SUBSYSTEM_EFI_BOOT_SERVICE_DRIVER: return "EFI_BOOT_SERVICE_DRIVER";
                case EXE_PE_OPTHDR_SUBSYSTEM_EFI_RUNTIME_DRIVER: return "EFI_RUNTIME_DRIVER";
                default:                                        break;
        }

        return "?";
}

struct exe_pe_opthdr_pe { // EXE_PE_OPTHDR_MAGIC_PE
        struct exe_pe_opthdr_pe_standard	        standard;			/* +0x00 */
	struct exe_pe_opthdr_pe_windows			windows;			/* +0x1C (size 0x44) */
};										        /* =0x60 */
/* data directory follows */
#pragma pack(pop)

const char *exe_ne_opthdr_magic_to_str(const uint16_t magic) {
        switch (magic) {
                case EXE_PE_OPTHDR_MAGIC_ROM:           return "ROM";
                case EXE_PE_OPTHDR_MAGIC_PE:            return "PE";
                case EXE_PE_OPTHDR_MAGIC_PEPLUS:        return "PE+";
                default:                                break;
        }

        return "?";
}

uint16_t exe_pe_opthdr_magic_value(struct exe_pe_optional_header_raw *h) {
        if (h->size >= 2)
                return *((uint16_t*)(h->data+0));

        return 0;
}

struct exe_pe_opthdr_data_directory_entry *exe_pe_opthdr_data_directory(struct exe_pe_optional_header_raw *h,size_t entry) {
#define COMMON_RETURN(ht,dt,entry) \
    if (h->size >= sizeof(ht)) {\
        ht *hdr = (ht*)(h->data);\
