
#include <assert.h>
#include <stdlib.h>
#include <stdint.h>
#include <string.h>
#include <unistd.h>
#include <stddef.h>
#include <errno.h>
#include <stdio.h>
#include <fcntl.h>
#include <ctype.h>

#include <hw/dos/exehdr.h>
#include <hw/dos/exenehdr.h>
#include <hw/dos/exenepar.h>

#ifndef O_BINARY
#define O_BINARY (0)
#endif

#define EXE_PE_SIGNATURE                                                        (0x4550U)

/* Characteristics flags */
#define EXE_PE_HEADER_IMAGE_FILE_RELOCS_STRIPPED                                0x0001
#define EXE_PE_HEADER_IMAGE_FILE_EXECUTABLE_IMAGE                               0x0002
#define EXE_PE_HEADER_IMAGE_FILE_LINE_NUMS_STRIPPED                             0x0004
#define EXE_PE_HEADER_IMAGE_FILE_LOCAL_SYMS_STRIPPED                            0x0008
#define EXE_PE_HEADER_IMAGE_FILE_AGGRESSIVE_WS_TRIM                             0x0010
#define EXE_PE_HEADER_IMAGE_FILE_LARGE_ADDRESS_AWARE                            0x0020
#define EXE_PE_HEADER_IMAGE_FILE_16BIT_MACHINE                                  0x0040
#define EXE_PE_HEADER_IMAGE_FILE_BYTES_REVERSED_LO                              0x0080
#define EXE_PE_HEADER_IMAGE_FILE_32BIT_MACHINE                                  0x0100
#define EXE_PE_HEADER_IMAGE_FILE_DEBUG_STRIPPED                                 0x0200
#define EXE_PE_HEADER_IMAGE_FILE_REMOVABLE_RUN_FROM_SWAP                        0x0400
#define EXE_PE_HEADER_IMAGE_FILE_NET_RUN_FROM_SWAP                              0x0800
#define EXE_PE_HEADER_IMAGE_FILE_SYSTEM                                         0x1000
#define EXE_PE_HEADER_IMAGE_FILE_DLL                                            0x2000
#define EXE_PE_HEADER_IMAGE_FILE_UP_SYSTEM_ONLY                                 0x4000
#define EXE_PE_HEADER_IMAGE_FILE_BYTES_REVERSED_HI                              0x8000

#pragma pack(push,1)
struct exe_pe_coff_file_header {
        uint16_t                                Machine;                        /* +0x00 target machine */
        uint16_t                                NumberOfSections;               /* +0x02 number of PE sections */
        uint32_t                                TimeDateStamp;                  /* +0x04 Time/Date timestamp */
        uint32_t                                PointerToSymbolTable;           /* +0x08 File offset of COFF symbol table or 0 */
        uint32_t                                NumberOfSymbols;                /* +0x0C Number of entries in symbol table */
        uint16_t                                SizeOfOptionalHeader;           /* +0x10 Size of the optional header */
        uint16_t                                Characteristics;                /* +0x12 Flags indicating attributes of the file */
};                                                                              /* =0x14 */
#pragma pack(pop)

#pragma pack(push,1)
/* This is the initial header. It does not define anything more because fields past this struct do vary */
struct exe_pe_header {
        uint32_t                                signature;                      /* +0x00 PE\0\0 */
        struct exe_pe_coff_file_header          fileheader;                     /* +0x04 COFF File Header (0x14 bytes) */
};                                                                              /* =0x18 */
/* optional header follows including section table */
#pragma pack(pop)

struct exe_pe_optional_header_raw {
        unsigned char*                          data;
        size_t                                  size;
        size_t                                  alloc_size;
};

const char *exe_pe_fileheader_machine_to_str(const uint16_t Machine) {
        switch (Machine) {
                case 0x0000:    return "UNKNOWN";
                case 0x014C:    return "I386";
                case 0x0162:    return "R3000";
                case 0x0166:    return "R4000";
                case 0x0168:    return "R10000";
                case 0x0169:    return "WCEMIPSV2";
                case 0x0184:    return "ALPHA";
                case 0x01A2:    return "SH3";
                case 0x01A3:    return "SH3DSP";
                case 0x01A6:    return "SH4";
                case 0x01A8:    return "SH5";
                case 0x01C0:    return "ARM";
                case 0x01C2:    return "THUMB";
                case 0x01D3:    return "AM33";
                case 0x01F0:    return "POWERPC";
                case 0x01F1:    return "POWERPCFP";
                case 0x0200:    return "IA64";
                case 0x0266:    return "MIPS16";
                case 0x0268:    return "M68K";
                case 0x0284:    return "ALPHA64";
                case 0x0366:    return "MIPSFPU";
                case 0x0466:    return "MIPSFPU16";
                case 0x0EBC:    return "EBC";
                case 0x8664:    return "AMD64";
                case 0x9041:    return "M32R";
                default:        break;
        }

        return "?";
}

#define EXE_PE_OPTHDR_MAGIC_ROM                         (0x0107)
#define EXE_PE_OPTHDR_MAGIC_PE				(0x010B)
#define EXE_PE_OPTHDR_MAGIC_PEPLUS			(0x020B)

#pragma pack(push,1)
struct exe_pe_opthdr_pe_standard { // EXE_PE_OPTHDR_MAGIC_PE
        uint16_t                                        Magic;                          /* +0x00 */
        uint8_t                                         MajorLinkerVersion;             /* +0x02 */
        uint8_t                                         MinorLinkerVersion;             /* +0x03 */
        uint32_t                                        SizeOfCode;                     /* +0x04 size of code [text], sum total */
        uint32_t                                        SizeOfInitializedData;          /* +0x08 size of initialized data, sum total */
        uint32_t                                        SizeOfUninitializedData;        /* +0x0C size of uninitialized data [bss], sum total */
        uint32_t                                        AddressOfEntryPoint;            /* +0x10 RVA of entry point, 0 if none (DLL) */
        uint32_t                                        BaseOfCode;                     /* +0x14 RVA of the base of code section */
        uint32_t                                        BaseOfData;                     /* +0x18 RVA of the base of data section */
};                                                                                      /* =0x1C */
#pragma pack(pop)

#pragma pack(push,1)
struct exe_pe_opthdr_peplus_standard { // EXE_PE_OPTHDR_MAGIC_PEPLUS
        uint16_t                                        Magic;                          /* +0x00 */
        uint8_t                                         MajorLinkerVersion;             /* +0x02 */
        uint8_t                                         MinorLinkerVersion;             /* +0x03 */
        uint32_t                                        SizeOfCode;                     /* +0x04 size of code [text], sum total */
        uint32_t                                        SizeOfInitializedData;          /* +0x08 size of initialized data, sum total */
        uint32_t                                        SizeOfUninitializedData;        /* +0x0C size of uninitialized data [bss], sum total */
        uint32_t                                        AddressOfEntryPoint;            /* +0x10 RVA of entry point, 0 if none (DLL) */
        uint32_t                                        BaseOfCode;                     /* +0x14 RVA of the base of code section */
};                                                                                      /* =0x18 */
#pragma pack(pop)

#pragma pack(push,1)
struct exe_pe_opthdr_pe_windows {
        uint32_t                                        ImageBase;                      /* +0x00 (+0x1C) preferred loading address */
        uint32_t                                        SectionAlignment;               /* +0x04 (+0x20) */
        uint32_t                                        FileAlignment;                  /* +0x08 (+0x24) */
        uint16_t                                        MajorOperatingSystemVersion;    /* +0x0C (+0x28) */
        uint16_t                                        MinorOperatingSystemVersion;    /* +0x0E (+0x2A) */
        uint16_t                                        MajorImageVersion;              /* +0x10 (+0x2C) */
        uint16_t                                        MinorImageVersion;              /* +0x12 (+0x2E) */
        uint16_t                                        MajorSubsystemVersion;          /* +0x14 (+0x30) */
        uint16_t                                        MinorSubsystemVersion;          /* +0x16 (+0x32) */
        uint32_t                                        Win32VersionValue;              /* +0x18 (+0x34) Reserved, zero */
        uint32_t                                        SizeOfImage;                    /* +0x1C (+0x38) */
        uint32_t                                        SizeOfHeaders;                  /* +0x20 (+0x3C) */
        uint32_t                                        CheckSum;                       /* +0x24 (+0x40) */
        uint16_t                                        Subsystem;                      /* +0x28 (+0x44) */
        uint16_t                                        DLLCharacteristics;             /* +0x2A (+0x46) */
        uint32_t                                        SizeOfStackReserve;             /* +0x2C (+0x48) */
        uint32_t                                        SizeOfStackCommit;              /* +0x30 (+0x4C) */
        uint32_t                                        SizeOfHeapReserve;              /* +0x34 (+0x50) */
        uint32_t                                        SizeOfHeapCommit;               /* +0x38 (+0x54) */
        uint32_t                                        LoaderFlags;                    /* +0x3C (+0x58) */
        uint32_t                                        NumberOfRvaAndSizes;            /* +0x40 (+0x5C) */
};                                                                                      /* =0x44 (+0x60) */
#pragma pack(pop)

#pragma pack(push,1)
struct exe_pe_opthdr_peplus_windows {
        uint64_t                                        ImageBase;                      /* +0x00 (+0x18) preferred loading address */
        uint32_t                                        SectionAlignment;               /* +0x08 (+0x20) */
        uint32_t                                        FileAlignment;                  /* +0x0C (+0x24) */
        uint16_t                                        MajorOperatingSystemVersion;    /* +0x10 (+0x28) */
        uint16_t                                        MinorOperatingSystemVersion;    /* +0x12 (+0x2A) */
        uint16_t                                        MajorImageVersion;              /* +0x14 (+0x2C) */
        uint16_t                                        MinorImageVersion;              /* +0x16 (+0x2E) */
        uint16_t                                        MajorSubsystemVersion;          /* +0x18 (+0x30) */
        uint16_t                                        MinorSubsystemVersion;          /* +0x1A (+0x32) */
        uint32_t                                        Win32VersionValue;              /* +0x1C (+0x34) Reserved, zero */
        uint32_t                                        SizeOfImage;                    /* +0x20 (+0x38) */
        uint32_t                                        SizeOfHeaders;                  /* +0x24 (+0x3C) */
        uint32_t                                        CheckSum;                       /* +0x28 (+0x40) */
        uint16_t                                        Subsystem;                      /* +0x2C (+0x44) */
        uint16_t                                        DLLCharacteristics;             /* +0x2E (+0x46) */
        uint64_t                                        SizeOfStackReserve;             /* +0x30 (+0x48) */
        uint64_t                                        SizeOfStackCommit;              /* +0x38 (+0x50) */
        uint64_t                                        SizeOfHeapReserve;              /* +0x40 (+0x58) */
        uint64_t                                        SizeOfHeapCommit;               /* +0x48 (+0x60) */
        uint32_t                                        LoaderFlags;                    /* +0x50 (+0x68) */
        uint32_t                                        NumberOfRvaAndSizes;            /* +0x54 (+0x6C) */
};                                                                                      /* =0x58 (+0x70) */
#pragma pack(pop)

#pragma pack(push,1)
struct exe_pe_opthdr_data_directory_entry {
	uint32_t					RVA;				/* +0x00 */
	uint32_t					Size;				/* +0x04 */
};											/* =0x08 */
#pragma pack(pop)
/* NTS: The "RVA" is a file offset if it's the directory entry index for the certificate table. */

#define EXE_PE_OPTHDR_DLLCHARACT_DYNAMIC_BASE                           0x0040
#define EXE_PE_OPTHDR_DLLCHARACT_FORCE_INTEGRITY                        0x0080
#define EXE_PE_OPTHDR_DLLCHARACT_NX_COMPAT                              0x0100
#define EXE_PE_OPTHDR_DLLCHARACT_NO_ISOLATION                           0x0200
#define EXE_PE_OPTHDR_DLLCHARACT_NO_SEH                                 0x0400
#define EXE_PE_OPTHDR_DLLCHARACT_NO_BIND                                0x0800
#define EXE_PE_OPTHDR_DLLCHARACT_WDM_DRIVER                             0x2000
#define EXE_PE_OPTHDR_DLLCHARACT_TERMINAL_SERVER_AWARE                  0x8000

enum exe_pe_opthdr_data_directory_index {
        EXE_PE_DATADIRENT_EXPORT_TABLE=0,
        EXE_PE_DATADIRENT_IMPORT_TABLE=1,
        EXE_PE_DATADIRENT_RESOURCE_TABLE=2,
        EXE_PE_DATADIRENT_EXCEPTION_TABLE=3,
        EXE_PE_DATADIRENT_CERTIFICATE_TABLE=4, // "RVA" is a file offset
        EXE_PE_DATADIRENT_BASE_RELOCATION_TABLE=5,
        EXE_PE_DATADIRENT_DEBUG=6,
        EXE_PE_DATADIRENT_ARCHITECTURE=7,
        EXE_PE_DATADIRENT_GLOBAL_PTR=8, // RVA to store in global ptr register, size must be zero
        EXE_PE_DATADIRENT_TLS_TABLE=9,
        EXE_PE_DATADIRENT_LOAD_CONFIG_TABLE=10,
        EXE_PE_DATADIRENT_BOUND_IMPORT=11,
        EXE_PE_DATADIRENT_IAT=12,
        EXE_PE_DATADIRENT_DELAY_IMPORT_DESCRIPTOR=13,
        EXE_PE_DATADIRENT_COMPLUS_RUNTIME_HEADER=14,
        EXE_PE_DATADIRENT_CLR_RUNTIME_HEADER=14,
        EXE_PE_DATADIRENT_RESERVED15=15,

        EXE_PE_DATADIRENT__MAX
};

const char *exe_pe_opthdr_data_directory_entry_str[EXE_PE_DATADIRENT__MAX] = {
        "Export table",                 // 0
        "Import table",
        "Resource table",
        "Exception table",
        "Certificate table",
        "Base relocation table",        // 5
        "Debug",
        "Architecture",
        "Global ptr",
        "TLS table",
        "Load config table",            // 10
        "Bound import",
        "IAT",
        "Delay import descriptor",
        "COM+/CLR runtime header",
        "Reserved"                      // 15
};

const char *exe_pe_opthdr_data_directory_entry_to_str(unsigned int i) {
        if (i < EXE_PE_DATADIRENT__MAX)
                return exe_pe_opthdr_data_directory_entry_str[i];
        return "?";
}

enum exe_pe_opthdr_subsystem {
        EXE_PE_OPTHDR_SUBSYSTEM_UNKNOWN=0,
        EXE_PE_OPTHDR_SUBSYSTEM_NATIVE=1,
        EXE_PE_OPTHDR_SUBSYSTEM_WINDOWS_GUI=2,
        EXE_PE_OPTHDR_SUBSYSTEM_WINDOWS_CUI=3,
        EXE_PE_OPTHDR_SUBSYSTEM_POSIX_CUI=7,
        EXE_PE_OPTHDR_SUBSYSTEM_WINDOWS_CE_GUI=9,
        EXE_PE_OPTHDR_SUBSYSTEM_EFI_APPLICATION=10,
        EXE_PE_OPTHDR_SUBSYSTEM_EFI_BOOT_SERVICE_DRIVER=11,
        EXE_PE_OPTHDR_SUBSYSTEM_EFI_RUNTIME_DRIVER=12,
        EXE_PE_OPTHDR_SUBSYSTEM_EFI_ROM=13,
        EXE_PE_OPTHDR_SUBSYSTEM_XBOX=14,

        EXE_PE_OPTHDR_SUBSYSTEM__MAX
};

const char *exe_pe_opthdr_subsystem_to_str(const uint16_t s) {
        switch (s) {
                case EXE_PE_OPTHDR_SUBSYSTEM_UNKNOWN:           return "UNKNOWN";
                case EXE_PE_OPTHDR_SUBSYSTEM_NATIVE:            return "NATIVE";
                case EXE_PE_OPTHDR_SUBSYSTEM_WINDOWS_GUI:       return "WINDOWS_GUI";
                case EXE_PE_OPTHDR_SUBSYSTEM_WINDOWS_CUI:       return "WINDOWS_CUI";
                case EXE_PE_OPTHDR_SUBSYSTEM_POSIX_CUI:         return "POSIX_CUI";
                case EXE_PE_OPTHDR_SUBSYSTEM_WINDOWS_CE_GUI:    return "WINDOWS_CE_GUI";
                case EXE_PE_OPTHDR_SUBSYSTEM_EFI_APPLICATION:   return "EFI_APPLICATION";
                case EXE_PE_OPTHDR_SUBSYSTEM_EFI_BOOT_SERVICE_DRIVER: return "EFI_BOOT_SERVICE_DRIVER";
                case EXE_PE_OPTHDR_SUBSYSTEM_EFI_RUNTIME_DRIVER: return "EFI_RUNTIME_DRIVER";
                case EXE_PE_OPTHDR_SUBSYSTEM_EFI_ROM:           return "EFI_ROM";
                case EXE_PE_OPTHDR_SUBSYSTEM_XBOX:              return "XBOX";
                default:                                        break;
        }

        return "?";
}

#pragma pack(push,1)
struct exe_pe_opthdr_pe { // EXE_PE_OPTHDR_MAGIC_PE
        struct exe_pe_opthdr_pe_standard	        standard;			/* +0x00 */
	struct exe_pe_opthdr_pe_windows			windows;			/* +0x1C (size 0x44) */
};										        /* =0x60 */
/* data directory follows */
#pragma pack(pop)

#pragma pack(push,1)
struct exe_pe_opthdr_peplus { // EXE_PE_OPTHDR_MAGIC_PEPLUS
        struct exe_pe_opthdr_peplus_standard            standard;			/* +0x00 */
	struct exe_pe_opthdr_peplus_windows             windows;			/* +0x18 (size 0x58) */
};										        /* =0x70 */
/* data directory follows */
#pragma pack(pop)

const char *exe_ne_opthdr_magic_to_str(const uint16_t magic) {
        switch (magic) {
                case EXE_PE_OPTHDR_MAGIC_ROM:           return "ROM";
                case EXE_PE_OPTHDR_MAGIC_PE:            return "PE";
                case EXE_PE_OPTHDR_MAGIC_PEPLUS:        return "PE+";
                default:                                break;
        }

        return "?";
}

uint16_t exe_pe_opthdr_magic_value(struct exe_pe_optional_header_raw *h) {
        if (h->size >= 2)
                return *((uint16_t*)(h->data+0));

        return 0;
}

#pragma pack(push,1)
struct exe_pe_section_table_entry {
        char                                            Name[8];                        /* +0x00 */
        uint32_t                                        VirtualSize;                    /* +0x08 */
        uint32_t                                        VirtualAddress;                 /* +0x0C */
        uint32_t                                        SizeOfRawData;                  /* +0x10 */
        uint32_t                                        PointerToRawData;               /* +0x14 */
        uint32_t                                        PointerToRelocations;           /* +0x18 */
        uint32_t                                        PointerToLinenumbers;           /* +0x1C */
        uint16_t                                        NumberOfRelocations;            /* +0x20 */
        uint16_t                                        NumberOfLinenumbers;            /* +0x22 */
        uint32_t                                        Characteristics;                /* +0x24 */
};											/* =0x28 */
#pragma pack(pop)

#define EXE_PE_SECTFLAGS_TYPE_REG                                               0x00000000 /* not a flag, just a constant */
#define EXE_PE_SECTFLAGS_TYPE_DSECT                                             0x00000001
#define EXE_PE_SECTFLAGS_TYPE_NOLOAD                                            0x00000002
#define EXE_PE_SECTFLAGS_TYPE_GROUP                                             0x00000004
#define EXE_PE_SECTFLAGS_TYPE_NO_PAD                                            0x00000008
#define EXE_PE_SECTFLAGS_TYPE_COPY                                              0x00000010
#define EXE_PE_SECTFLAGS_CNT_CODE                                               0x00000020
#define EXE_PE_SECTFLAGS_CNT_INITIALIZED_DATA                                   0x00000040
#define EXE_PE_SECTFLAGS_CNT_UNINITIALIZED_DATA                                 0x00000080
#define EXE_PE_SECTFLAGS_LNK_OTHER                                              0x00000100
#define EXE_PE_SECTFLAGS_LNK_INFO                                               0x00000200
#define EXE_PE_SECTFLAGS_TYPE_OVER                                              0x00000400
#define EXE_PE_SECTFLAGS_LNK_REMOVE                                             0x00000800
#define EXE_PE_SECTFLAGS_LNK_COMDAT                                             0x00001000
#define EXE_PE_SECTFLAGS_MEM_FARDATA                                            0x00008000
#define EXE_PE_SECTFLAGS_MEM_PURGEABLE                                          0x00020000
#define EXE_PE_SECTFLAGS_MEM_16BIT                                              0x00020000
#define EXE_PE_SECTFLAGS_MEM_LOCKED                                             0x00040000
#define EXE_PE_SECTFLAGS_MEM_PRELOAD                                            0x00080000

/* enumeration within SCN_ALIGN_MASK */
#define EXE_PE_SECTFLAGS_SCN_ALIGN_1BYTES                                       0x00100000
#define EXE_PE_SECTFLAGS_SCN_ALIGN_2BYTES                                       0x00200000
#define EXE_PE_SECTFLAGS_SCN_ALIGN_4BYTES                                       0x00300000
#define EXE_PE_SECTFLAGS_SCN_ALIGN_8BYTES                                       0x00400000
#define EXE_PE_SECTFLAGS_SCN_ALIGN_16BYTES                                      0x00500000
#define EXE_PE_SECTFLAGS_SCN_ALIGN_32BYTES                                      0x00600000
#define EXE_PE_SECTFLAGS_SCN_ALIGN_64BYTES                                      0x00700000
#define EXE_PE_SECTFLAGS_SCN_ALIGN_128BYTES                                     0x00800000
#define EXE_PE_SECTFLAGS_SCN_ALIGN_256BYTES                                     0x00900000
#define EXE_PE_SECTFLAGS_SCN_ALIGN_512BYTES                                     0x00A00000
#define EXE_PE_SECTFLAGS_SCN_ALIGN_1024BYTES                                    0x00B00000
#define EXE_PE_SECTFLAGS_SCN_ALIGN_2048BYTES                                    0x00C00000
#define EXE_PE_SECTFLAGS_SCN_ALIGN_4096BYTES                                    0x00D00000
#define EXE_PE_SECTFLAGS_SCN_ALIGN_8192BYTES                                    0x00E00000
#define EXE_PE_SECTFLAGS_SCN_ALIGN_MASK                                         0x00F00000
#define EXE_PE_SECTFLAGS_SCN_ALIGN_MASKSHIFT                                    20

#define EXE_PE_SECTFLAGS_LNK_NRELOC_OVFL                                        0x01000000
#define EXE_PE_SECTFLAGS_MEM_DISCARDABLE                                        0x02000000
#define EXE_PE_SECTFLAGS_MEM_NOT_CACHED                                         0x04000000
#define EXE_PE_SECTFLAGS_MEM_NOT_PAGED                                          0x08000000
#define EXE_PE_SECTFLAGS_MEM_SHARED                                             0x10000000
#define EXE_PE_SECTFLAGS_MEM_EXECUTE                                            0x20000000
#define EXE_PE_SECTFLAGS_MEM_READ                                               0x40000000
#define EXE_PE_SECTFLAGS_MEM_WRITE                                              0x80000000

typedef uint64_t EXE_PE_VA; /* virtual address */
typedef uint32_t EXE_PE_RVA; /* relative virtual address */

/* hash table lookup */
#define EXE_PE_HASHTBL_SIZE     256
typedef uint8_t EXE_PE_HASH_T;

struct pe_header_vablock { // one 4KB block of virtual address space
	unsigned char*			MEM;
	EXE_PE_VA			VA;
	struct pe_header_vablock*	next;
};

struct pe_header_vamem {
	struct pe_header_vablock*	hash[EXE_PE_HASHTBL_SIZE]; // alloc here
	EXE_PE_VA			pagemask;
	EXE_PE_VA			alloc;
	EXE_PE_VA			alloc_limit;
};

void pe_header_vablock_free(struct pe_header_vamem *v,struct pe_header_vablock **h) {
	if (*h) {
		struct pe_header_vablock *n = (*h)->next;
		if ((*h)->MEM) free((*h)->MEM);
		(*h)->next = NULL;
		(*h)->VA = 0;
		free(*h);
		*h = n;

		assert(v->alloc >= (v->pagemask+(EXE_PE_VA)1u));
		v->alloc -= (v->pagemask+(EXE_PE_VA)1u);
	}
}

void pe_header_vablock_freeall(struct pe_header_vamem *v,struct pe_header_vablock **h) {
	while (*h != NULL)
		pe_header_vablock_free(v,h);
}

EXE_PE_HASH_T pe_header_parser_hashva(EXE_PE_VA v) {
        v ^=  (v >> (EXE_PE_VA)32u) ^ (EXE_PE_VA)0xA151;
        v ^= ~(v >> (EXE_PE_VA)16u) ^ (EXE_PE_VA)0x23B6;
        v ^=  (v >>  (EXE_PE_VA)8u) ^ (EXE_PE_VA)0x19EA;
        return (EXE_PE_HASH_T)v;
}

static inline size_t pe_header_vamem_pageofs(struct pe_header_vamem *v,EXE_PE_VA va) {
	return (size_t)(va & v->pagemask); /* byte offset within page */
}

struct pe_header_vablock *pe_header_vablock_lookup(struct pe_header_vablock *h,EXE_PE_VA va) {
	for (;h != NULL;h=h->next) {
		if (h->VA == va)
			return h;
	}

	return NULL;
}

struct pe_header_vablock *pe_header_vablock_insert(struct pe_header_vamem *v,struct pe_header_vablock **h,EXE_PE_VA va) {
	/* enforce allocation limit */
	if (v->alloc >= v->alloc_limit)
		return NULL;

	/* assumes caller has already checked there is no block for page containing va, va is already masked by ~pagemask */
	{
		struct pe_header_vablock *nb = malloc(sizeof(struct pe_header_vablock));
		if (nb != NULL) {
			nb->MEM = malloc((size_t)(v->pagemask+1u));
			if (!nb->MEM) {
				free(nb);
				return NULL;
			}
			memset(nb->MEM,0,(size_t)(v->pagemask+1u));
			v->alloc += (v->pagemask+(EXE_PE_VA)1u);
			nb->VA = va;

			/* insert into head of list */
			nb->next = (*h);
			(*h) = nb;
			return nb;
		}
	}

	return NULL;
}

struct pe_header_vablock *pe_header_vamem_insert(struct pe_header_vamem *v,EXE_PE_VA va) {
	/* assumes caller has already checked there is no block for page containing va */
	const EXE_PE_HASH_T hashi = pe_header_parser_hashva(va & (~v->pagemask));
	return pe_header_vablock_insert(v,&v->hash[hashi],va & (~v->pagemask));
}

struct pe_header_vablock *pe_header_vamem_lookup(struct pe_header_vamem *v,EXE_PE_VA va) {
	const EXE_PE_HASH_T hashi = pe_header_parser_hashva(va & (~v->pagemask));
	return pe_header_vablock_lookup(v->hash[hashi],va & (~v->pagemask));
}

void pe_header_vamem_free(struct pe_header_vamem *v) {
	unsigned int i;

	for (i=0;i < EXE_PE_HASHTBL_SIZE;i++)
		pe_header_vablock_freeall(v,&v->hash[i]);

	assert(v->alloc == 0);
	free(v);
}

struct pe_header_vamem *pe_header_vamem_alloc(uint32_t pagesize) {
	struct pe_header_vamem *v;

	if (pagesize == 0 || (pagesize & (pagesize - 1u)) != 0) /* must be power of 2 and nonzero */
		return NULL;

	v = malloc(sizeof(*v));
	if (v == NULL)
		return NULL;

	memset(v,0,sizeof(*v));
	v->pagemask = pagesize - 1u;
#if TARGET_MSDOS == 16
#  if defined(__LARGE__) || defined(__COMPACT__) || defined(__HUGE__)
	v->alloc_limit = (EXE_PE_VA)256u << (EXE_PE_VA)10u; // 256KB limit (should fit well within 640KB)
#  else
	v->alloc_limit = (EXE_PE_VA)16u << (EXE_PE_VA)10u; // 16KB limit (should fit well within 64KB)
#  endif
#else
	v->alloc_limit = (EXE_PE_VA)32u << (EXE_PE_VA)20u; // 32MB limit (Linux kernel OOM killer will terminate this program if we allocate too much memory)
#endif
	return v;
}

struct pe_header_parser {
        int                                             src_fd; /* does not own descriptor */
        uint32_t                                        pe_header_offset;
        struct exe_pe_header                            pe_header;
        uint32_t                                        opthdr_offset;
        uint16_t                                        opthdr_magic;
        struct exe_pe_optional_header_raw               opthdr_raw; /* allocated */
        struct exe_pe_opthdr_data_directory_entry*      datadir; /* points into opthdr_raw */
        size_t                                          datadir_count;
        uint32_t                                        sections_offset;
        struct exe_pe_section_table_entry*              sections; /* allocated */
        size_t                                          sections_count;
        EXE_PE_VA                                       imagebase;
        EXE_PE_VA                                       imagesize;
        uint32_t                                        sectionalign;
        struct pe_header_vamem*                         vmem;
};

#pragma pack(push,1)
struct pe_header_import_directory_table {
        uint32_t                                        ImportLookupTableRVA;     /* +0x00 RVA */
        uint32_t                                        TimeDateStamp;            /* +0x04 */
        uint32_t                                        ForwarderChain;           /* +0x08 index */
        uint32_t                                        NameRVA;                  /* +0x0C RVA */
        uint32_t                                        ImportAddressTableRVA;    /* +0x10 RVA */
};                                                                                /* =0x14 */
#pragma pack(pop)

#pragma pack(push,1)
struct pe_header_export_directory_table {
        uint32_t                                        ExportFlags;                    /* +0x00 */
        uint32_t                                        TimeDateStamp;                  /* +0x04 */
        uint16_t                                        MajorVersion;                   /* +0x08 */
        uint16_t                                        MinorVersion;                   /* +0x0A */
        uint32_t                                        NameRVA;                        /* +0x0C */
        uint32_t                                        OrdinalBase;                    /* +0x10 */
        uint32_t                                        AddressTableEntries;            /* +0x14 */
        uint32_t                                        NumberOfNamePointers;           /* +0x18 */
        uint32_t                                        ExportAddressTableRVA;          /* +0x1C */
        uint32_t                                        NamePointerRVA;                 /* +0x20 */
        uint32_t                                        OrdinalTableRVA;                /* +0x24 */
};                                                                                      /* =0x28 */
#pragma pack(pop)

#pragma pack(push,1)
struct pe_header_resource_directory_table {
        uint32_t                                        Characteristics;                /* +0x00 */
        uint32_t                                        TimeDateStamp;                  /* +0x04 */
        uint16_t                                        MajorVersion;                   /* +0x08 */
        uint16_t                                        MinorVersion;                   /* +0x0A */
        uint16_t                                        NumberOfNameEntries;            /* +0x0C */
        uint16_t                                        NumberOfIDEntries;              /* +0x0E */
};                                                                                      /* =0x10 */
#pragma pack(pop)

#pragma pack(push,1)
struct pe_header_resource_directory_entry {
	union {
		uint32_t				NameRVA;			/* +0x00 */
		uint32_t				IntegerID;			/* +0x00 */
	} f;
	union {
		uint32_t				DataEntryRVA;			/* +0x04 */
		uint32_t				SubdirectoryRVA;		/* +0x04 */
	} s;
};                                                                                      /* =0x08 */
#pragma pack(pop)

static inline EXE_PE_VA pe_header_parser_RVAtoVA(struct pe_header_parser *hp,const EXE_PE_RVA addr) {
        return (EXE_PE_VA)addr + hp->imagebase;
}

static inline EXE_PE_RVA pe_header_parser_VAtoRVA(struct pe_header_parser *hp,const EXE_PE_VA addr) {
        return (EXE_PE_RVA)(addr - hp->imagebase);
}

struct pe_header_vamem *pe_header_parser_vamem(struct pe_header_parser *hp) {
	if (!hp->vmem) hp->vmem = pe_header_vamem_alloc(hp->sectionalign);
	return hp->vmem;
}

struct exe_pe_section_table_entry *pe_header_parser_section_table_lookupVA(struct pe_header_parser *hp,EXE_PE_VA va) {
        struct exe_pe_section_table_entry *himatch = NULL;
        size_t si;

        /* Microsoft says that the sections must be in ascending order and adjacent, probably so that their code can search like this */
