/* auto-generated from dev_vxd_dev_vmm.vxddef, do not edit. */

/* Windows Virtual Machine Manager                                                 */
/*                                                                                 */
/* This is "built in" to the kernel and is a core device of the Windows system.    */
/*                                                                                 */
/* File location (Windows 3.0/3.1): C:\WINDOWS\SYSTEM\WIN386.EXE                   */
/* File location (Windows 95/98/ME): C:\WINDOWS\SYSTEM\VMM32.VXD                   */
/*                                                                                 */
/* Note that in both cases, the VMM does not exist as a standalone VxD device      */
/* but as code "built in" to the Windows kernel. VMM32.VXD and WIN386.EXE are      */
/* executables containing the kernel and a packed structure containing the         */
/* VxD device drivers in a "pre-digested" form. The VxD drivers contained within   */
/* do not contain the MS-DOS header, but start with the LE header. The LE header   */
/* is modified slightly to change one of the fields to instead indicate resident   */
/* length. This packed structure is known as 'W3' and 'W4', referring to the       */
/* extended header pointed to by the MS-DOS header. The 'W3' header is merely      */
/* a list of the VxDs and where they exist elsewhere in the same EXE               */

#define VMM_snr__Get_CPUID_Flags                             0x019D    /* ver 4.10+ */
#define VMM_snr__RegisterGARTHandler                         0x019E    /* ver 4.10+ */
#define VMM_snr__GARTReserve                                 0x019F    /* ver 4.10+ */
#define VMM_snr__GARTCommit                                  0x01A0    /* ver 4.10+ */
#define VMM_snr__GARTUnCommit                                0x01A1    /* ver 4.10+ */
#define VMM_snr__GARTFree                                    0x01A2    /* ver 4.10+ */
#define VMM_snr__GARTMemAttributes                           0x01A3    /* ver 4.10+ */
#define VMM_snr_VMMCreateThreadEx                            0x01A4    /* ver 4.10+ */
#define VMM_snr__FlushCaches                                 0x01A5    /* ver 4.10+ */
#define VMM_snr_Set_Thread_Win32_Pri_NoYield                 0x01A6    /* ver 4.10+ */
#define VMM_snr__FlushMappedCacheBlock                       0x01A7    /* ver 4.10+ */
#define VMM_snr__ReleaseMappedCacheBlock                     0x01A8    /* ver 4.10+ */
#define VMM_snr_Run_Preemptable_Events                       0x01A9    /* ver 4.10+ */
#define VMM_snr__MMPreSystemExit                             0x01AA    /* ver 4.10+ */
#define VMM_snr__MMPageFileShutDown                          0x01AB    /* ver 4.10+ */
#define VMM_snr__Set_Global_Time_Out_Ex                      0x01AC    /* ver 4.10+ */
#define VMM_snr_Query_Thread_Priority                        0x01AD    /* ver 4.10+ */
#define VMM_snr__UnmapPhysToLinear                           0x01AE    /* ver 4.90+ */
#define VMM_snr__VmmRtInfo                                   0x01AF    /* ver 4.90+ */
#define VMM_snr__MPGetProcessorCount                         0x01B0    /* ver 4.90+ */
#define VMM_snr__MPEnterSingleProcessor                      0x01B1    /* ver 4.90+ */
#define VMM_snr__MPLeaveSingleProcessor                      0x01B2    /* ver 4.90+ */

/* NOTE: Some VxD calls are defined static inline to return a struct. As long as you simply read the */
/*       structure members, GCC's optimizer will boil it down to direct register access of the values */
/*       returned by the call and direct testing of the CPU flags. */

/* NOTE: Some VxD calls may be listed as 'asynchronous', which is Microsoft's term to mean a VxD call */
/*       that can be safely called from a hardware (asynchronous) interrupt. Non-asynchronous calls are */
/*       not reentrant and can cause problems if called in a reentrant manner. */

#if defined(__GNUC__) /* GCC only, for now */
# if defined(GCC_INLINE_ASM_SUPPORTS_cc_OUTPUT) /* we require GCC 6.1 or higher with support for CPU flags as output */
/*-------------------------------------------------------------*/
/*

  "The following structures are pointed to by EBP when VxD routines are entered,
   both for VxD control calls and traps(I/O traps, software INT traps, etc.).
   The first structure as DWORD values, the second WORD values and the last
   has BYTE values." -- Windows 3.1 DDK VMM.INC

 */
#pragma pack(push,1)
/* struct Client_Reg_Struc */
typedef struct Client_Reg_Struc {
    uint32_t        Client_EDI;                     /* +0x0000 Client's EDI */
    uint32_t        Client_ESI;                     /* +0x0004 Client's ESI */
    uint32_t        Client_EBP;                     /* +0x0008 Client's EBP */
    uint32_t        __unnamed_12;                   /* +0x000C ESP at pushall */
    uint32_t        Client_EBX;                     /* +0x0010 Client's EBX */
    uint32_t        Client_EDX;                     /* +0x0014 Client's EDX */
    uint32_t        Client_ECX;                     /* +0x0018 Client's ECX */
    uint32_t        Client_EAX;                     /* +0x001C Client's EAX */
    uint32_t        Client_Error;                   /* +0x0020 Dword error code */
    uint32_t        Client_EIP;                     /* +0x0024 EIP */
    uint16_t        Client_CS;                      /* +0x0028 CS */
    uint16_t        __unnamed_42;                   /* +0x002A (padding) */
    uint32_t        Client_EFlags;                  /* +0x002C EFLAGS */
    uint32_t        Client_ESP;                     /* +0x0030 ESP */
    uint16_t        Client_SS;                      /* +0x0034 SS */
    uint16_t        __unnamed_54;                   /* +0x0036 (padding) */
    uint16_t        Client_ES;                      /* +0x0038 ES */
    uint16_t        __unnamed_58;                   /* +0x003A (padding) */
    uint16_t        Client_DS;                      /* +0x003C DS */
    uint16_t        __unnamed_62;                   /* +0x003E (padding) */
    uint16_t        Client_FS;                      /* +0x0040 FS */
    uint16_t        __unnamed_66;                   /* +0x0042 (padding) */
    uint16_t        Client_GS;                      /* +0x0044 GS */
    uint16_t        __unnamed_70;                   /* +0x0046 (padding) */
    uint32_t        Client_Alt_EIP;                 /* +0x0048  */
    uint16_t        Client_Alt_CS;                  /* +0x004C  */
    uint16_t        __unnamed_78;                   /* +0x004E  */
    uint32_t        Client_Alt_EFlags;              /* +0x0050  */
    uint32_t        Client_Alt_ESP;                 /* +0x0054  */
    uint16_t        Client_Alt_SS;                  /* +0x0058  */
    uint16_t        __unnamed_90;                   /* +0x005A  */
    uint16_t        Client_Alt_ES;                  /* +0x005C  */
    uint16_t        __unnamed_94;                   /* +0x005E  */
    uint16_t        Client_Alt_DS;                  /* +0x0060  */
    uint16_t        __unnamed_98;                   /* +0x0062  */
    uint16_t        Client_Alt_FS;                  /* +0x0064  */
    uint16_t        __unnamed_102;                  /* +0x0066  */
    uint16_t        Client_Alt_GS;                  /* +0x0068  */
    uint16_t        __unnamed_106;                  /* +0x006A  */
} Client_Reg_Struc;
/* end Client_Reg_Struc */

/* struct Client_Word_Reg_Struc */
typedef struct Client_Word_Reg_Struc {
    uint16_t        Client_DI;                      /* +0x0000 Client's DI */
    uint16_t        __unnamed_2;                    /* +0x0002 (padding) */
    uint16_t        Client_SI;                      /* +0x0004 Client's SI */
    uint16_t        __unnamed_6;                    /* +0x0006 (padding) */
    uint16_t        Client_BP;                      /* +0x0008 Client's BP */
    uint16_t        __unnamed_10;                   /* +0x000A (padding) */
    uint32_t        __unnamed_12;                   /* +0x000C ESP at pushall */
    uint16_t        Client_BX;                      /* +0x0010 Client's BX */
    uint16_t        __unnamed_18;                   /* +0x0012 (padding) */
    uint16_t        Client_DX;                      /* +0x0014 Client's DX */
    uint16_t        __unnamed_22;                   /* +0x0016 (padding) */
    uint16_t        Client_CX;                      /* +0x0018 Client's CX */
    uint16_t        __unnamed_26;                   /* +0x001A (padding) */
    uint16_t        Client_AX;                      /* +0x001C Client's AX */
    uint16_t        __unnamed_30;                   /* +0x001E (padding) */
    uint32_t        __unnamed_32;                   /* +0x0020 Dword error code */
    uint16_t        Client_IP;                      /* +0x0024 Client's IP */
    uint16_t        __unnamed_38;                   /* +0x0026 (padding) */
    uint32_t        __unnamed_40;                   /* +0x0028 CS */
    uint16_t        Client_Flags;                   /* +0x002C Client's flags (low) */
    uint16_t        __unnamed_46;                   /* +0x002E (padding) */
    uint16_t        Client_SP;                      /* +0x0030 SP */
    uint16_t        __unnamed_50;                   /* +0x0032  */
    uint32_t        __unnamed_52;                   /* +0x0034  */
    uint32_t        __unnamed_56;                   /* +0x0038  */
    uint32_t        __unnamed_60;                   /* +0x003C  */
    uint32_t        __unnamed_64;                   /* +0x0040  */
    uint32_t        __unnamed_68;                   /* +0x0044  */
    uint16_t        Client_Alt_IP;                  /* +0x0048  */
    uint16_t        __unnamed_74;                   /* +0x004A  */
    uint32_t        __unnamed_76;                   /* +0x004C  */
    uint16_t        Client_Alt_Flags;               /* +0x0050  */
    uint16_t        __unnamed_82;                   /* +0x0052  */
    uint16_t        Client_Alt_SP;                  /* +0x0054  */
} Client_Word_Reg_Struc;
/* end Client_Word_Reg_Struc */

/* struct Client_Byte_Reg_Struc */
typedef struct Client_Byte_Reg_Struc {
    uint32_t        __unnamed_0;                    /* +0x0000 EDI, ESI, EBP, ESP at pushall */
    uint32_t        __unnamed_4;                    /* +0x0004 EDI, ESI, EBP, ESP at pushall */
    uint32_t        __unnamed_8;                    /* +0x0008 EDI, ESI, EBP, ESP at pushall */
    uint32_t        __unnamed_12;                   /* +0x000C EDI, ESI, EBP, ESP at pushall */
    uint8_t         Client_BL;                      /* +0x0010 Client's BL */
    uint8_t         Client_BH;                      /* +0x0011 Client's BH */
    uint16_t        __unnamed_18;                   /* +0x0012 (padding) */
    uint8_t         Client_DL;                      /* +0x0014 Client's DL */
    uint8_t         Client_DH;                      /* +0x0015 Client's DH */
    uint16_t        __unnamed_22;                   /* +0x0016 (padding) */
    uint8_t         Client_CL;                      /* +0x0018 Client's CL */
    uint8_t         Client_CH;                      /* +0x0019 Client's CH */
    uint16_t        __unnamed_26;                   /* +0x001A (padding) */
    uint8_t         Client_AL;                      /* +0x001C Client's AL */
    uint8_t         Client_AH;                      /* +0x001D Client's AH */
} Client_Byte_Reg_Struc;
/* end Client_Byte_Reg_Struc */
#pragma pack(pop)
/*-------------------------------------------------------------*/

/*-------------------------------------------------------------*/
/* description: */
/*   Scheduler boost values (*_Boost)                                                                 */
/*                                                                                                    */
/*   Source: Windows 3.1 DDK, D:\386\INCLUDE\VMM.INC, line 1524 SCHEDULER BOOST VALUES binary EQUates */
#define Reserved_Low_Boost     0x00000001U /* 1U << 0U bit[0] Reserved for use by the system */
#define Cur_Run_VM_Boost       0x00000004U /* 1U << 2U bit[2] Used by time-slice scheduler to force a VM to run for it's allotted time-slice */
#define Low_Pri_Device_Boost   0x00000010U /* 1U << 4U bit[4] For events that need timely processing, but are not time critical */
#define High_Pri_Device_Boost  0x00001000U /* 1U << 12U bit[12] For events that need timely processing, but should not circumvent operations that have a critical section boost */
#define Critical_Section_Boost 0x00100000U /* 1U << 20U bit[20] Used by the system for virtual machines specified in a call to Begin_Critical_Section */
#define Time_Critical_Boost    0x00400000U /* 1U << 22U bit[22] For events that MUST be processed even with another VM is in a critical section (example: VPICD when simulating hardware interrupts) */
#define Reserved_High_Boost    0x40000000U /* 1U << 30U bit[30] Reserved for use by the system */

/*-------------------------------------------------------------*/
/* VMM Get_VMM_Version (VMMCall dev=0x0001 serv=0x0000) WINVER=3.0+ */

/* description: */
/*   Return VMM version */

/* inputs: */
/*   None */

/* outputs: */
/*   AX = version (AH=Major AL=Minor (example: 0x030A = 3.10)) */
/*   ECX = Debug (debug development revision number) */

typedef struct Get_VMM_Version__response {
    uint16_t version; /* AX */
    uint32_t Debug; /* ECX */
} Get_VMM_Version__response;

static inline Get_VMM_Version__response Get_VMM_Version(void) {
    register Get_VMM_Version__response r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Get_VMM_Version)
        : /* outputs */ "=a" (r.version), "=c" (r.Debug)
        : /* inputs */
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Get_Cur_VM_Handle (VMMCall dev=0x0001 serv=0x0001) WINVER=3.0+ */

/* description: */
/*   Return current VM handle */

/* inputs: */
/*   None */

/* outputs: */
/*   EBX = Handle of the current VM */

/* returns: */
/*   Current VM handle */

/* asynchronous: */
/*   yes */

static inline vxd_vm_handle_t Get_Cur_VM_Handle(void) {
    register vxd_vm_handle_t r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Get_Cur_VM_Handle)
        : /* outputs */ "=b" (r)
        : /* inputs */
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Test_Cur_VM_Handle (VMMCall dev=0x0001 serv=0x0002) WINVER=3.0+ */

/* description: */
/*   Test whether VM handle is current VM */

/* inputs: */
/*   EBX = VM (VM handle to test) */

/* outputs: */
/*   ZF = ZF set if vm handle matches */

/* returns: */
/*   Boolean value. True if VM handle matches, false if not. */

/* asynchronous: */
/*   yes */

static inline _Bool Test_Cur_VM_Handle(vxd_vm_handle_t const VM/*ebx*/) {
    register _Bool r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Test_Cur_VM_Handle)
        : /* outputs */ "=@ccz" (r)
        : /* inputs */ "b" (VM)
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Get_Sys_VM_Handle (VMMCall dev=0x0001 serv=0x0003) WINVER=3.0+ */

/* description: */
/*   Return system VM handle */

/* inputs: */
/*   None */

/* outputs: */
/*   EBX = Handle of the system VM */

/* returns: */
/*   System VM handle */

/* asynchronous: */
/*   yes */

static inline vxd_vm_handle_t Get_Sys_VM_Handle(void) {
    register vxd_vm_handle_t r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Get_Sys_VM_Handle)
        : /* outputs */ "=b" (r)
        : /* inputs */
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Test_Sys_VM_Handle (VMMCall dev=0x0001 serv=0x0004) WINVER=3.0+ */

/* description: */
/*   Test whether VM handle is system VM */

/* inputs: */
/*   EBX = VM (VM handle to test) */

/* outputs: */
/*   ZF = ZF set if vm handle matches */

/* returns: */
/*   Boolean value. True if VM handle matches the one given, false if not. */

/* asynchronous: */
/*   yes */

static inline _Bool Test_Sys_VM_Handle(vxd_vm_handle_t const VM/*ebx*/) {
    register _Bool r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Test_Sys_VM_Handle)
        : /* outputs */ "=@ccz" (r)
        : /* inputs */ "b" (VM)
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Validate_VM_Handle (VMMCall dev=0x0001 serv=0x0005) WINVER=3.0+ */

/* description: */
/*   Verify that the VM handle is valid */

/* inputs: */
/*   EBX = VM (VM handle to test) */

/* outputs: */
/*   !CF = CF is set if NOT valid, clear if valid. Return value should invert sense. */

/* returns: */
/*   Boolean value. True if VM handle is valid, false if invalid. */

/* asynchronous: */
/*   yes */

static inline _Bool Validate_VM_Handle(vxd_vm_handle_t const VM/*ebx*/) {
    register _Bool r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Validate_VM_Handle)
        : /* outputs */ "=@ccnc" (r)
        : /* inputs */ "b" (VM)
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Get_VMM_Reenter_Count (VMMCall dev=0x0001 serv=0x0006) WINVER=3.0+ */

/* description: */
/*   Return the number of times the VMM has been reentered. If nonzero, use only asynchronous calls. */

/* inputs: */
/*   None */

/* outputs: */
/*   ECX = number of times VMM has been reentered */

static inline uint32_t Get_VMM_Reenter_Count(void) {
    register uint32_t r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Get_VMM_Reenter_Count)
        : /* outputs */ "=c" (r)
        : /* inputs */
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Begin_Reentrant_Execution (VMMCall dev=0x0001 serv=0x0007) WINVER=3.0+ */

/* description: */
/*   Start reentrant execution. You can use this when hooking VMM faults (reentrant processor faults) */
/*   in order to call non-asynchronous VMM or virtual device services or execute a virtual machine.   */
/*   Do not use this service to avoid scheduling events on hardware interrupts.                       */

/* inputs: */
/*   None */

/* outputs: */
/*   ECX = old reentrancy count */

/* returns: */
/*   unsigned int containing old reentrancy count, which must be saved and given to End_Reentrancy_Execution later on. */

static inline uint32_t Begin_Reentrant_Execution(void) {
    register uint32_t r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Begin_Reentrant_Execution)
        : /* outputs */ "=c" (r)
        : /* inputs */
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM End_Reentrant_Execution (VMMCall dev=0x0001 serv=0x0008) WINVER=3.0+ */

/* description: */
/*   Ends reentrant execution, after Begin_Reentrant_Execution. */

/* inputs: */
/*   ECX = Count (reentrancy count returned by Begin_Reentrant_Execution) */

/* outputs: */
/*   None */

static inline void End_Reentrant_Execution(uint32_t const Count/*ecx*/) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_End_Reentrant_Execution)
        : /* outputs */
        : /* inputs */ "c" (Count)
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM Install_V86_Break_Point (VMMCall dev=0x0001 serv=0x0009) WINVER=3.0+ */

/* description: */
/*   Insert a break point in virtual 8086 memory of the current virtual machine, and         */
/*   insert a breakpoint callback procedure to receive control when the break point happens. */

/* inputs: */
/*   EAX = BreakAddr (V86 address to place the break point) */
/*   EDX = RefData (pointer to reference data to be passed to callback procedure) */
/*   ESI = Callback (pointer to callback procedure to install (32-bit offset)) */

/* outputs: */
/*   !CF = success (CF clear) or failure (CF set) */

/* returns: */
/*   Bool, true if success, false if failure (not installed) */

static inline _Bool Install_V86_Break_Point(const void* const BreakAddr/*eax*/,const void* const RefData/*edx*/,const void* const Callback/*esi*/) {
    register _Bool r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Install_V86_Break_Point)
        : /* outputs */ "=@ccnc" (r)
        : /* inputs */ "a" (BreakAddr), "d" (RefData), "S" (Callback)
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Remove_V86_Break_Point (VMMCall dev=0x0001 serv=0x000A) WINVER=3.0+ */

/* description: */
/*   Remove a virtual 8086 break point installed with Install_V86_Break_Point in the current VM */

/* inputs: */
/*   EAX = BreakAddr (V86 address to remove break point from) */

/* outputs: */
/*   None */

static inline void Remove_V86_Break_Point(const void* const BreakAddr/*eax*/) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Remove_V86_Break_Point)
        : /* outputs */
        : /* inputs */ "a" (BreakAddr)
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM Allocate_V86_Call_Back (VMMCall dev=0x0001 serv=0x000B) WINVER=3.0+ */

/* description: */
/*   Install a callback procedure for virtual 8086 mode applications can call to execute code in */
/*   a virtual device.                                                                           */

/* inputs: */
/*   EDX = RefData (points to reference data to pass to callback procedure) */
/*   ESI = Callback (points to callback procedure to call) */

/* outputs: */
/*   CF = error (if success, CF=0 and EAX=realmode ptr. if failure, CF=1) */
/*   EAX = CallbackAddr (if CF=0, segment:offset of real-mode callback address) */

typedef struct Allocate_V86_Call_Back__response {
    _Bool error; /* CF */
    uint32_t CallbackAddr; /* EAX */
} Allocate_V86_Call_Back__response;

static inline Allocate_V86_Call_Back__response Allocate_V86_Call_Back(const void* const RefData/*edx*/,const void* const Callback/*esi*/) {
    register Allocate_V86_Call_Back__response r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Allocate_V86_Call_Back)
        : /* outputs */ "=@ccc" (r.error), "=a" (r.CallbackAddr)
        : /* inputs */ "d" (RefData), "S" (Callback)
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Allocate_PM_Call_Back (VMMCall dev=0x0001 serv=0x000C) WINVER=3.0+ */

/* description: */
/*   Install a callback procedure for protected mode applications to call to execute code in a virtual device. */

/* inputs: */
/*   EDX = RefData (points to reference data to pass to callback procedure) */
/*   ESI = Callback (points to callback procedure to call) */

/* outputs: */
/*   CF = error (if success, CF=0 and EAX=realmode ptr. if failure, CF=1) */
/*   EAX = CallbackAddr (if CF=0, address of callback procedure) */

typedef struct Allocate_PM_Call_Back__response {
    _Bool error; /* CF */
    uint32_t CallbackAddr; /* EAX */
} Allocate_PM_Call_Back__response;

static inline Allocate_PM_Call_Back__response Allocate_PM_Call_Back(const void* const RefData/*edx*/,const void* const Callback/*esi*/) {
    register Allocate_PM_Call_Back__response r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Allocate_PM_Call_Back)
        : /* outputs */ "=@ccc" (r.error), "=a" (r.CallbackAddr)
        : /* inputs */ "d" (RefData), "S" (Callback)
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Call_When_VM_Returns (VMMCall dev=0x0001 serv=0x000D) WINVER=3.0+ */

/* description: */
/*   Install a callback procedure to receive control when a virtual machine executes the IRET instruction for  */
/*   the current interrupt.                                                                                    */
/*                                                                                                             */
/*   if TimeOut is positive, callback is called if VM does not execute IRET within the timeout period.         */
/*   if TimeOut is negative, callabck is called when timeout occurs and again when IRET is executed by the VM. */
/*   if TimeOut is zero, timeout is ignored.                                                                   */

/* inputs: */
/*   EAX = TimeOut (number of milliseconds for timeout. see description for details.) */
/*   EDX = RefData (pointer to reference data to pass to callback) */
/*   ESI = Callback (callback procedure (32-bit flat)) */

/* outputs: */
/*   None */

static inline void Call_When_VM_Returns(int32_t const TimeOut/*eax*/,const void* const RefData/*edx*/,const void* const Callback/*esi*/) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Call_When_VM_Returns)
        : /* outputs */
        : /* inputs */ "a" (TimeOut), "d" (RefData), "S" (Callback)
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM Schedule_Global_Event (VMMCall dev=0x0001 serv=0x000E) WINVER=3.0+ */

/* description: */
/*   Schedule a global event, which does not require a specific virtual machine to process it. */
/*   The system does not switch tasks before calling the procedure.                            */
/*                                                                                             */
/*   The callback can carry out any actions and use any VMM services. It is called like this:  */
/*                                                                                             */
/*   mov ebx,VM ; current VM handle                                                            */
/*   mov edx,RefData ; reference data pointer                                                  */
/*   mov ebp,crs ; pointer to a Client_Reg_Struc                                               */
/*   call [EventCallback]                                                                      */
/*                                                                                             */
/*   You can cancel a scheduled event using Cancel_Global_Event                                */

/* inputs: */
/*   ESI = EventCallback (pointer to callback procedure (32-bit flat)) */
/*   EDX = RefData (pointer to reference data to pass to callback) */

/* outputs: */
/*   ESI = event handle */

/* asynchronous: */
/*   yes */

static inline vxd_global_event_handle_t Schedule_Global_Event(const void* const EventCallback/*esi*/,const void* const RefData/*edx*/) {
    register vxd_global_event_handle_t r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Schedule_Global_Event)
        : /* outputs */ "=S" (r)
        : /* inputs */ "S" (EventCallback), "d" (RefData)
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Schedule_VM_Event (VMMCall dev=0x0001 serv=0x000F) WINVER=3.0+ */

/* description: */
/*   Schedule an event for the specified virtual machine. The system will carry out a task switch */
/*   to the virtual machine before calling the event callback procedure.                          */
/*                                                                                                */
/*   You can cancel a scheduled event using Cancel_VM_Event                                       */

/* inputs: */
/*   EBX = VM (VM handle to schedule event) */
/*   ESI = EventCallback (pointer to callback procedure (32-bit flat)) */
/*   EDX = RefData (pointer to reference data to pass to callback) */

/* outputs: */
/*   ESI = event handle */

/* asynchronous: */
/*   yes */

static inline vxd_vm_event_handle_t Schedule_VM_Event(vxd_vm_handle_t const VM/*ebx*/,const void* const EventCallback/*esi*/,const void* const RefData/*edx*/) {
    register vxd_vm_event_handle_t r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Schedule_VM_Event)
        : /* outputs */ "=S" (r)
        : /* inputs */ "b" (VM), "S" (EventCallback), "d" (RefData)
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Call_Global_Event (VMMCall dev=0x0001 serv=0x0010) WINVER=3.0+ */

/* description: */
/*   Call the event callback procedure immediately, or schedule a global event if the virtual device */
/*   is processing a hardware interrupt that interrupted the VMM.                                    */
/*                                                                                                   */
/*   You can cancel the event (if scheduled) using Cancel_Global_Event.                              */

/* inputs: */
/*   ESI = EventCallback (pointer to callback procedure (32-bit flat)) */
/*   EDX = RefData (pointer to reference data to pass to callback) */

/* outputs: */
/*   ESI = event handle, or 0 if procedure was called immediately without scheduling. */

/* asynchronous: */
/*   yes */

static inline vxd_global_event_handle_t Call_Global_Event(const void* const EventCallback/*esi*/,const void* const RefData/*edx*/) {
    register vxd_global_event_handle_t r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Call_Global_Event)
        : /* outputs */ "=S" (r)
        : /* inputs */ "S" (EventCallback), "d" (RefData)
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Call_VM_Event (VMMCall dev=0x0001 serv=0x0011) WINVER=3.0+ */

/* description: */
/*   Call the event callback procedure immediately, or schedule a VM event if the virtual device */
/*   is processing a hardware interrupt that interrupted the VMM.                                */
/*                                                                                               */
/*   You can cancel the event (if scheduled) using Cancel_VM_Event.                              */

/* inputs: */
/*   EBX = VM (VM handle) */
/*   ESI = EventCallback (pointer to callback procedure (32-bit flat)) */
/*   EDX = RefData (pointer to reference data to pass to callback) */

/* outputs: */
/*   ESI = event handle, or 0 if procedure was called immediately without scheduling. */

/* asynchronous: */
/*   yes */

static inline vxd_vm_event_handle_t Call_VM_Event(vxd_vm_handle_t const VM/*ebx*/,const void* const EventCallback/*esi*/,const void* const RefData/*edx*/) {
    register vxd_vm_event_handle_t r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Call_VM_Event)
        : /* outputs */ "=S" (r)
        : /* inputs */ "b" (VM), "S" (EventCallback), "d" (RefData)
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Cancel_Global_Event (VMMCall dev=0x0001 serv=0x0012) WINVER=3.0+ */

/* description: */
/*   Cancel a global event previously scheduled by Schedule_Global_Event or Call_Global_Event                  */
/*   A virtual device must not attempt to cancel an event where the callback function has already been called. */

/* inputs: */
/*   ESI = Event (Event handle, or 0 if no event should be cancelled.) */

/* outputs: */
/*   None */

static inline void Cancel_Global_Event(vxd_global_event_handle_t const Event/*esi*/) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Cancel_Global_Event)
        : /* outputs */
        : /* inputs */ "S" (Event)
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM Cancel_VM_Event (VMMCall dev=0x0001 serv=0x0013) WINVER=3.0+ */

/* description: */
/*   Cancel a VM event previously scheduled by Schedule_VM_Event or Call_VM_Event                              */
/*   A virtual device must not attempt to cancel an event where the callback function has already been called. */

/* inputs: */
/*   EBX = VM (VM handle) */
/*   ESI = Event (Event handle, or 0 if no event should be cancelled.) */

/* outputs: */
/*   None */

static inline void Cancel_VM_Event(uint32_t const VM/*ebx*/,vxd_vm_event_handle_t const Event/*esi*/) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Cancel_VM_Event)
        : /* outputs */
        : /* inputs */ "b" (VM), "S" (Event)
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* description: */
/*   Flags for Call_Priority_VM_Event (PEF_*)                                                            */
/*                                                                                                       */
/*   Source: Windows 3.1 DDK, D:\386\INCLUDE\VMM.INC, line 1537 FLAGS FOR CALL_PRIORITY_VM_EVENT EQUates */
#define PEF_Wait_For_STI      0x00000001U /* 1U << 0U bit[0] Callback procedure is not called until VM enables interrupts */
#define PEF_Wait_For_STI_Bit  0
#define PEF_Wait_Not_Crit     0x00000002U /* 1U << 1U bit[1] Callback procedure is not called until VM is not in a critical section or time-critical operation */
#define PEF_Wait_Not_Crit_Bit 1
#define PEF_Dont_Unboost      0x00000004U /* 1U << 2U bit[2] Priority of the VM is not reduced after return from callback */
#define PEF_Dont_Unboost_Bit  2
#define PEF_Always_Sched      0x00000008U /* 1U << 3U bit[3] Event is always scheduled, callback is never called immediately */
#define PEF_Always_Sched_Bit  3
#define PEF_Time_Out          0x00000010U /* 1U << 4U bit[4] Use timeout value in EDI (Windows 3.1 or higher) */
#define PEF_Time_Out_Bit      4

/*-------------------------------------------------------------*/
/* VMM Call_Priority_VM_Event (VMMCall dev=0x0001 serv=0x0014) WINVER=3.0+ */

/* description: */
/*   Calls the callback procedure immediately, or schedules a priority event for the specified virtual machine.   */
/*   Scheduling is done if the virtual device is processing a hardware interrupt that interrupted the VMM,        */
/*   or the current virtual machine is not the specified VM, or if the Flags parameter specifies the              */
/*   PEF_Always_Sched value.                                                                                      */
/*                                                                                                                */
/*   PriorityBoost must be a value limited such that when added to the VM's current execution priority the result */
/*   is within range of Reserved_Low_Boost to Reserved_High_Boost.                                                */

/* inputs: */
/*   EAX = PriorityBoost (positive, 0, or negative priority boost for the VM.) */
/*   EBX = VM (VM handle) */
/*   ECX = Flags (how to carry out the event. See PEF_* constants, ORed together.) */
/*   EDX = RefData (pointer to reference data for callback) */
/*   ESI = EventCallback (pointer to callback) */
/*   EDI = TimeOut (timeout in milliseconds IFF PEF_Time_Out is specified.) */

/* outputs: */
/*   ESI = event handle, or 0 if procedure was called immediately. */

static inline vxd_priority_vm_event_handle_t Call_Priority_VM_Event(int32_t const PriorityBoost/*eax*/,vxd_vm_handle_t const VM/*ebx*/,uint32_t const Flags/*ecx*/,const void* const RefData/*edx*/,const void* const EventCallback/*esi*/,uint32_t const TimeOut/*edi*/) {
    register vxd_priority_vm_event_handle_t r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Call_Priority_VM_Event)
        : /* outputs */ "=S" (r)
        : /* inputs */ "a" (PriorityBoost), "b" (VM), "c" (Flags), "d" (RefData), "S" (EventCallback), "D" (TimeOut)
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Cancel_Priority_VM_Event (VMMCall dev=0x0001 serv=0x0015) WINVER=3.0+ */

/* description: */
/*   Cancels an event previously schedule by Call_Priority_VM_Event.                                             */
/*   A virtual device must not attempt to cancel an event where the callback function has already been called.   */
/*   Any priority boost will be cancelled even if PEF_Dont_Unboost_Bit was specified when the event was created. */
/*   Do NOT use this call to cancel events scheduled using the Call_VM_Event or Schedule_VM_Event services, for  */
/*   those types of events you must use Cancel_VM_Event.                                                         */

/* inputs: */
/*   ESI = Event (event handle, or 0 if nothing to cancel) */

/* outputs: */
/*   None */

static inline void Cancel_Priority_VM_Event(vxd_priority_vm_event_handle_t const Event/*esi*/) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Cancel_Priority_VM_Event)
        : /* outputs */
        : /* inputs */ "S" (Event)
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM Get_NMI_Handler_Addr (VMMCall dev=0x0001 serv=0x0016) WINVER=3.0+ */

/* description: */
/*   Return the address of the current Non-Maskable Interrupt handler */

/* inputs: */
/*   None */

/* outputs: */
/*   ESI = pointer to current NMI handler */

static inline const void* Get_NMI_Handler_Addr(void) {
    register const void* r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Get_NMI_Handler_Addr)
        : /* outputs */ "=S" (r)
        : /* inputs */
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Set_NMI_Handler_Addr (VMMCall dev=0x0001 serv=0x0017) WINVER=3.0+ */

/* description: */
/*   Set the Non-Maskable Interrupt vector to point to the specified handler.                    */
/*   The NMI handler is forbidden to call any virtual device or VMM services and                 */
/*   it must restrict itself to access only local data in the VxD_LOCKED_DATA_SEG segment.       */
/*   A virtual device that needs to use VMM services from NMI should instead use Hook_NMI_Event. */
/*                                                                                               */
/*   The handler must NOT execute the IRET instruction. It must jump to the previous NMI handler */
/*   that it retrieved from Get_NMI_Handler_Addr. x86 architecture design dictates that the CPU  */
/*   ignores additional NMIs until it executes the IRET instruction.                             */

/* inputs: */
/*   ESI = nmi (pointer to NMI handler) */

/* outputs: */
/*   None */

static inline void Set_NMI_Handler_Addr(const void* const nmi/*esi*/) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Set_NMI_Handler_Addr)
        : /* outputs */
        : /* inputs */ "S" (nmi)
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM Hook_NMI_Event (VMMCall dev=0x0001 serv=0x0018) WINVER=3.0+ */

/* description: */
/*   Install a Non-Maskable Interrupt event procedure. Event procedures are called in install  */
/*   order after the last handler in the NMI handler chain has been executed. Event procedures */
/*   are allowed to make VMM calls that are not permitted in NMI handlers.                     */
/*                                                                                             */
/*   NMI event procedures can be interrupted by another NMI, reentrancy is possible.           */

/* inputs: */
/*   ESI = NmiProc (pointer to NMI event handler) */

/* outputs: */
/*   None */

static inline void Hook_NMI_Event(const void* const NmiProc/*esi*/) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Hook_NMI_Event)
        : /* outputs */
        : /* inputs */ "S" (NmiProc)
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM Call_When_VM_Ints_Enabled (VMMCall dev=0x0001 serv=0x0019) WINVER=3.0+ */

/* description: */
/*   Install a callback procedure that the system calls whenever the virtual machine enables interrupts. */
/*   The callback is called immediately if interrupts are already enabled. Virtual devices use this to   */
/*   receive notification when the virtual machine enables interrupts.                                   */
/*                                                                                                       */
/*   It is usually more convenient to use Call_Priority_VM_Event, but this call is faster.               */

/* inputs: */
/*   EDX = RefData (pointer to reference data to pass to callback) */
/*   ESI = Callback (pointer to callback function) */

/* outputs: */
/*   None */

static inline void Call_When_VM_Ints_Enabled(const void* const RefData/*edx*/,const void* const Callback/*esi*/) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Call_When_VM_Ints_Enabled)
        : /* outputs */
        : /* inputs */ "d" (RefData), "S" (Callback)
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM Enable_VM_Ints (VMMCall dev=0x0001 serv=0x001A) WINVER=3.0+ */

/* description: */
/*   Enable interrupts for the current virtual machine. It has the same effect as if the VM had executed the STI instruction. */

/* inputs: */
/*   None */

/* outputs: */
/*   None */

static inline void Enable_VM_Ints(void) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Enable_VM_Ints)
        : /* outputs */
        : /* inputs */
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM Disable_VM_Ints (VMMCall dev=0x0001 serv=0x001B) WINVER=3.0+ */

/* description: */
/*   Disable interrupts for the current virtual machine. It has the same effect as if the VM had executed the CLI instruction. */

/* inputs: */
/*   None */

/* outputs: */
/*   None */

static inline void Disable_VM_Ints(void) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Disable_VM_Ints)
        : /* outputs */
        : /* inputs */
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM Map_Flat (VMMCall dev=0x0001 serv=0x001C) WINVER=3.0+ */

/* description: */
/*   Convert a segment:offset or selector:offset pair to a linear address only for the current virtual machine.                          */
/*   The segment is converted as a V86 segment, or protected mode selector, depending on the execution state of the virtual machine.     */
/*   If the virtual machine is running 32-bit protected mode code, then the full 32 bits of the register are used.                       */
/*   For 16-bit protected mode and V86 code, only the lower 16 bits are used.                                                            */
/*                                                                                                                                       */
/*   The parameter in this function is the full 16-bit contents of register AX, which contains the two 8-bit values stored in AH and AL. */
/*   AH is SegOffset, the byte offset from the start of the Client_Reg_Struc structure to the segment/selector register to convert.      */
/*   AL is OffOffset, the byte offset from the start of the Client_Reg_Struc structure to the register with the offset to convert.       */
/*   If AL is -1 (0xFF), then 0 is used as the offset of the address to convert (NOT the offset into the Client_Reg_Struc)               */
/*                                                                                                                                       */
/*   To form the parameter correctly for this function:                                                                                  */
/*                                                                                                                                       */
/*   Map_Flat((SegOffset << 8) + OffOffset);                                                                                             */
/*                                                                                                                                       */
/*   The linear address returned is the ring-0 linear address that corresponds to the segment:offset address specified.                  */

/* inputs: */
/*   AX = SegOffOffset (AX = [AH,AL] 16-bit value, AH=SegOffset AL=OffOffset) */

/* outputs: */
/*   EAX = linear address, or -1 (0xFFFFFFFF) if invalid */

static inline uint32_t Map_Flat(uint16_t const SegOffOffset/*ax*/) {
    register uint32_t r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Map_Flat)
        : /* outputs */ "=a" (r)
        : /* inputs */ "a" (SegOffOffset)
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Map_Lin_To_VM_Addr (VMMCall dev=0x0001 serv=0x001D) WINVER=3.0+ */

/* description: */
/*   Convert a 32-bit ring-0 linear address to a V86 or protected mode address appropriate                                                */
/*   for the current execution mode of the current virtual machine.                                                                       */
/*                                                                                                                                        */
/*   If the execution state of the virtual machine is V86 mode, then the returned pair is a segment:offset value.                         */
/*   This call will fail in V86 mode if the linear address is outside the 1MB limit of the                                                */
/*   current virtual machine's 1MB virtual 8086 mode address space.                                                                       */
/*                                                                                                                                        */
/*   If the execution state of the virtual machine is protected mode, then the                                                            */
/*   returned pair is a selector:offset value produced by creating a new entry in the                                                     */
/*   virtual machine's LDT (Local Descriptor Table).                                                                                      */
/*                                                                                                                                        */
/*   A device must never free a selector returned by this service. There is no function to free the mapping. Use this function sparingly. */

/* inputs: */
/*   EAX = LineAddr (Linear address to convert) */
/*   ECX = Limit (segment limit in bytes - 1 (a value of 0 means 1 byte long)) */

/* outputs: */
/*   CX = SegSel (segment/selector if success) */
/*   CF = error (CF set if error, clear if success) */
/*   EDX = Offset (address offset) */

typedef struct Map_Lin_To_VM_Addr__response {
    _Bool error; /* CF */
    uint16_t SegSel; /* CX */
    uint32_t Offset; /* EDX */
} Map_Lin_To_VM_Addr__response;

static inline Map_Lin_To_VM_Addr__response Map_Lin_To_VM_Addr(const void* const LineAddr/*eax*/,uint32_t const Limit/*ecx*/) {
    register Map_Lin_To_VM_Addr__response r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Map_Lin_To_VM_Addr)
        : /* outputs */ "=c" (r.SegSel), "=@ccc" (r.error), "=d" (r.Offset)
        : /* inputs */ "a" (LineAddr), "c" (Limit)
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Adjust_Exec_Priority (VMMCall dev=0x0001 serv=0x001E) WINVER=3.0+ */

/* description: */
/*   Raise or lower the execution priority of the specified virtual machine. */

/* inputs: */
/*   EAX = PriorityBoost (*_Boost constant value) */
/*   EBX = VM (VM handle) */

/* outputs: */
/*   None */

static inline void Adjust_Exec_Priority(int32_t const PriorityBoost/*eax*/,vxd_vm_handle_t const VM/*ebx*/) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Adjust_Exec_Priority)
        : /* outputs */
        : /* inputs */ "a" (PriorityBoost), "b" (VM)
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* description: */
/*   Flags for Begin_Critical_Section (Block_*)                 */
/*                                                              */
/*   Source: Windows 3.1 DDK, D:\386\INCLUDE\VMM.INC, line 1553 */
#define Block_Svc_Ints               0x00000001U /* 1U << 0U bit[0] Service interrupts in the virtual machine even if the virtual machine is blocked */
#define Block_Svc_Ints_Bit           0
#define Block_Svc_If_Ints_Locked     0x00000002U /* 1U << 1U bit[1] Service interrupts in the virtual machine even if the virtual machine is blocked and the VMStat_V86IntsLocked flag is set. */
#define Block_Svc_If_Ints_Locked_Bit 1
#define Block_Enable_Ints            0x00000004U /* 1U << 2U bit[2] Service interrupts in the virtual machine even if the virtual machine does not currently have interrupts enabled. Force interrupts to be enabled. Only relevant if (Svc_Ints | Svc_If_Ints_Locked) is set */
#define Block_Enable_Ints_Bit        2
#define Block_Poll                   0x00000008U /* 1U << 3U bit[3] Do not switch away from the blocked virtual machine unless another machine has higher priority. */
#define Block_Poll_Bit               3

/*-------------------------------------------------------------*/
/* VMM Begin_Critical_Section (VMMCall dev=0x0001 serv=0x001F) WINVER=3.0+ */

/* description: */
/*   Cause the current virtual machine to enter a critical section.                                   */
/*   Only one virtual machine can own the critical section at a time.                                 */
/*   This call will block until the critical section is available.                                    */
/*   The system maintains a count of critical section claim calls.                                    */
/*   The critical section is only released when the count is reduced to zero by End_Critical_Section. */
/*   Claiming the critical section boosts the priority of the current VM by Critical_Section_Boost.   */
/*   While in a critical section, the system will task switch only if the virtual machine blocks      */
/*   on a semaphore or the other task has a time-critical operation.                                  */

/* inputs: */
/*   ECX = Flags (flags for service. See Block_* constants.) */

/* outputs: */
/*   None */

static inline void Begin_Critical_Section(uint32_t const Flags/*ecx*/) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Begin_Critical_Section)
        : /* outputs */
        : /* inputs */ "c" (Flags)
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM End_Critical_Section (VMMCall dev=0x0001 serv=0x0020) WINVER=3.0+ */

/* description: */
/*   Release the critical section if claim count is reduced to zero.                                            */
/*   Calling this function decrements the claim count, and releases the critical section if the result is zero. */
/*   Releasing the critical section also lowers the execution priority of the current virtual machine,          */
/*   and may cause a task switch if a higher-priority non-suspended virtual machine is waiting.                 */

/* inputs: */
/*   None */

/* outputs: */
/*   None */

static inline void End_Critical_Section(void) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_End_Critical_Section)
        : /* outputs */
        : /* inputs */
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM End_Crit_And_Suspend (VMMCall dev=0x0001 serv=0x0021) WINVER=3.0+ */

/* description: */
/*   Release the critical section and immediately suspend the current virtual machine.                         */
/*   If the claim count is not 1 (and therefore the call will not release the section), the function will fail */
/*   and not change the claim count and return an error. If the system cannot suspend the virtual machine,     */
/*   then it will return an error.                                                                             */

/* inputs: */
/*   None */

/* outputs: */
/*   !CF = CF set if error (not released), CF clear if success */

/* returns: */
/*   Bool true if success, false if error */

static inline _Bool End_Crit_And_Suspend(void) {
    register _Bool r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_End_Crit_And_Suspend)
        : /* outputs */ "=@ccnc" (r)
        : /* inputs */
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Claim_Critical_Section (VMMCall dev=0x0001 serv=0x0022) WINVER=3.0+ */

/* description: */
/*   Increment the critical section claim count by the specified amount (as if calling Begin_Critical_Section by that many times) */

/* inputs: */
/*   EAX = Claims (how much to increment. zero is valid, but ignored) */
/*   ECX = Flags (Block_* constants) */

/* outputs: */
/*   None */

static inline void Claim_Critical_Section(uint32_t const Claims/*eax*/,uint32_t const Flags/*ecx*/) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Claim_Critical_Section)
        : /* outputs */
        : /* inputs */ "a" (Claims), "c" (Flags)
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM Release_Critical_Section (VMMCall dev=0x0001 serv=0x0023) WINVER=3.0+ */

/* description: */
/*   Decrement the critical section claim count by the specified amount (as if calling End_Critical_Section by that many times) */

/* inputs: */
/*   ECX = Claims (how much to decrement. zero is valid, but ignored) */

/* outputs: */
/*   None */

static inline void Release_Critical_Section(uint32_t const Claims/*ecx*/) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Release_Critical_Section)
        : /* outputs */
        : /* inputs */ "c" (Claims)
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM Call_When_Not_Critical (VMMCall dev=0x0001 serv=0x0024) WINVER=3.0+ */

/* description: */
/*   Install a critical section callback to be called when a virtual device releases the critical section.      */
/*   The callback is not executed until the current VM's execution priority is less than Critical_Section_Boost */
/*   even if the current virtual machine is not in a critical section, so that virtual devices can release      */
/*   a critical section and process any simulated interrupts before the system calls the callback procedure.    */
/*   Any number of callbacks can be installed, but the system will only call the most recent callback, and then */
/*   remove it from the list.                                                                                   */

/* inputs: */
/*   ESI = CritSecCallback (pointer to callback procedure) */
/*   EDX = RefData (pointer to reference data to pass to callback) */

/* outputs: */
/*   None */

static inline void Call_When_Not_Critical(const void* const CritSecCallback/*esi*/,const void* const RefData/*edx*/) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Call_When_Not_Critical)
        : /* outputs */
        : /* inputs */ "S" (CritSecCallback), "d" (RefData)
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM Create_Semaphore (VMMCall dev=0x0001 serv=0x0025) WINVER=3.0+ */

/* description: */
/*   Allocate and initialize a new semaphore. */

/* inputs: */
/*   ECX = TokenCount (initial token count) */

/* outputs: */
/*   CF = error (CF set if error, CF clear if success) */
/*   EAX = Semaphore (semaphore handle if CF=0) */

typedef struct Create_Semaphore__response {
    vxd_semaphore_handle_t Semaphore; /* EAX */
    _Bool error; /* CF */
} Create_Semaphore__response;

static inline Create_Semaphore__response Create_Semaphore(uint32_t const TokenCount/*ecx*/) {
    register Create_Semaphore__response r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Create_Semaphore)
        : /* outputs */ "=@ccc" (r.error), "=a" (r.Semaphore)
        : /* inputs */ "c" (TokenCount)
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Destroy_Semaphore (VMMCall dev=0x0001 serv=0x0026) WINVER=3.0+ */

/* description: */
/*   Destroy the specified semaphore. */

/* inputs: */
/*   EAX = Semaphore (semaphore handle to delete) */

/* outputs: */
/*   None */

static inline void Destroy_Semaphore(vxd_semaphore_handle_t const Semaphore/*eax*/) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Destroy_Semaphore)
        : /* outputs */
        : /* inputs */ "a" (Semaphore)
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM Wait_Semaphore (VMMCall dev=0x0001 serv=0x0027) WINVER=3.0+ */

/* description: */
/*   Block the current virtual machine (wait) until the semaphore is signaled using Signal_Semaphore service. */

/* inputs: */
/*   EAX = Semaphore (semaphore handle to wait on) */
/*   ECX = Flags (Block_* constants) */

/* outputs: */
/*   None */

static inline void Wait_Semaphore(vxd_semaphore_handle_t const Semaphore/*eax*/,uint32_t const Flags/*ecx*/) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Wait_Semaphore)
        : /* outputs */
        : /* inputs */ "a" (Semaphore), "c" (Flags)
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM Signal_Semaphore (VMMCall dev=0x0001 serv=0x0028) WINVER=3.0+ */

/* description: */
/*   Unblocks the virtual machine (if any) waiting on the semaphore. */

/* inputs: */
/*   EAX = Semaphore (semaphore handle) */

/* outputs: */
/*   None */

static inline void Signal_Semaphore(vxd_semaphore_handle_t const Semaphore/*eax*/) {
    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Signal_Semaphore)
        : /* outputs */
        : /* inputs */ "a" (Semaphore)
        : /* clobbered */
    );
}

/*-------------------------------------------------------------*/
/* VMM Get_Crit_Section_Status (VMMCall dev=0x0001 serv=0x0029) WINVER=3.0+ */

/* description: */
/*   Returns the claim count and owner of the critical section.               */
/*   If the claim count is zero, it returns VM == Current VM and Claims == 0. */

/* inputs: */
/*   None */

/* outputs: */
/*   EBX = VM (VM handle of owner) */
/*   ECX = Claims (number of times claimed) */
/*   CF = high_priority (CF set if priority is Critical_Section_Boost or higher) */

/* asynchronous: */
/*   no */

typedef struct Get_Crit_Section_Status__response {
    vxd_vm_handle_t VM; /* EBX */
    uint32_t Claims; /* ECX */
    _Bool high_priority; /* CF */
} Get_Crit_Section_Status__response;

static inline Get_Crit_Section_Status__response Get_Crit_Section_Status(void) {
    register Get_Crit_Section_Status__response r;

    __asm__ (
        VXD_AsmCall(VMM_Device_ID,VMM_snr_Get_Crit_Section_Status)
        : /* outputs */ "=b" (r.VM), "=c" (r.Claims), "=@ccc" (r.high_priority)
        : /* inputs */
        : /* clobbered */
    );

    return r;
}

/*-------------------------------------------------------------*/
/* VMM Call_When_Task_Switched (VMMCall dev=0x0001 serv=0x002A) WINVER=3.0+ */

/* description: */
/*   Install a task-switched callback procedure that is called whenever the system carries out a task switch.  */
/*   Use this service sparingly and optimize the callback procedure for speed.                                 */
/*   For use by virtual devices that must save the state of a hardware device every time a task switch occurs. */
